app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("name", "created_at", "updated_at", "company_id", "website", "hq", "size", "founded", "industry", "revenue", "synopsis") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"